require('dotenv').config();
const { Telegraf, Markup } = require('telegraf');

const bot = new Telegraf(process.env.BOT_TOKEN, {
    polling: {
        interval: 300,
        autoStart: true
    }
});

const languagesKeyboard = Markup.inlineKeyboard([
    Markup.button.callback('Русский', 'russian'),
    Markup.button.callback('Қазақша', 'kazakh'),
]);

const mainMenuKeyboardRU = Markup.keyboard([
    ['Об олимпиаде Мың бала'],
    ['Все важные сроки олимпиады'],
    ['Не помню логин от личного кабинета'],
    ['Не помню пароль от личного кабинета или не могу войти в личный кабинет'],
    ['Как начать тест?'],
    ['Технические неполадки - не могу сдать тест'],
        ['Сменить язык']
]).oneTime();
const mainMenuKeyboardKZ = Markup.keyboard([
    ['Мың бала олимпиадасы туралы'],
    ['Олимпиаданың барлық маңызды мерзімдері'],
    ['Жеке кабинетінің логині есімде жоқ'],
    ['Жеке кабинеттің құпия сөзі есімде жоқ немесе жеке кабинетке кіре алмаймын'],
    ['Тестті қалай бастауға болады?'],
    ['Техникалық ақаулар - тест тапсыра алмаймын:'],
        ['Тілді өзгерту']
]).oneTime();


bot.start((ctx) => {
    ctx.reply('Выберите язык:' + '\n' + 'Тілді танданыз:', languagesKeyboard);
});
bot.hears('Сменить язык', (ctx) => {
    ctx.reply('Выберите язык:' + '\n' + 'Тілді танданыз:', languagesKeyboard);
});
bot.hears('Тілді өзгерту', (ctx) => {
    ctx.reply('Выберите язык:' + '\n' + 'Тілді танданыз:', languagesKeyboard);
});
function sendWelcomeMessageRu(ctx) {
    ctx.reply('Добро пожаловать на Национальную олимпиаду Мың бала для учеников 6 класса сельских школ. \n' +
        '\n' +
        'На первом этапе олимпиады можно принять участие только с ноутбука или компьютера с веб-камерой, так как используется система прокторинга для проверки академической честности.\n' +
        '\n' +
        '1000bala.elumiti.kz\n' +
        '8 727 310 02 58 call center (звонок платный)');
    ctx.reply('Чем мы вам можем помочь?', mainMenuKeyboardRU);
}

bot.action('russian', (ctx) => {
    sendWelcomeMessageRu(ctx);
});
bot.hears('На главную', (ctx) => {
    sendWelcomeMessageRu(ctx);
});
function sendWelcomeMessageKz(ctx) {
    ctx.reply('Ауыл мектептерінің 6 сынып оқушыларына арналған "Мың бала" ұлттық олимпиадасына қош келдіңіздер!\n' +
        '\n' +
        'Олимпиаданың бірінші кезеңінде академиялық адалдықты тексеру мақсатында прокторинг жүйесі қолданылады. Сондықтан тек ноутбук немесе веб-камерасы бар компьютер арқылы қатысуға болады.\n' +
        '\n' +
        '1000bala.elumiti.kz\n' +
        '8 727 310 02 58 call center (қоңырау шалу - ақылы)');

    ctx.reply('Біз сізге қалай көмектесе аламыз?', mainMenuKeyboardKZ);
}
bot.action('kazakh', (ctx) => {
    sendWelcomeMessageKz(ctx);
});
bot.hears('Басты бетке', (ctx) => {
    sendWelcomeMessageKz(ctx);
});

// Об олимпиаде Мың бала
bot.hears('Об олимпиаде Мың бала', (ctx) => {
    ctx.reply('Выберите интересующий вас вопрос:',
        Markup.keyboard([
            ['Кто сможет участвовать в олимпиаде?'],
            ['Учителя каких предметов могут претендовать на сертификат?'],
            ['Какие предметы в 1 этапе?'],
            ['Какие предметы во 2 этапе?'],
            ['Как и где проходит 1 этап?'],
            ['Технические требования к сдаче 1 этапа'],
            ['Можно ли подать апелляцию или пересдать тест?'],
            ['Что такое прокторинг? И почему тест 1 этапа можно сдать только через ноутбук или компьютер с web камерой?'],
            ['Как можно подготовиться и выиграть олимпиаду?'],
            ['Как и где проходит 2 этап?']
        ]).oneTime()
    );
});
bot.hears('Кто сможет участвовать в олимпиаде?', (ctx) => {
    ctx.reply('Только зарегистрированные до 10 марта участники из 6 классов сельских школ', Markup.keyboard([
        ['На главную']
    ]).oneTime());
});
bot.hears('Учителя каких предметов могут претендовать на сертификат?', (ctx) => {
    ctx.reply('"Учителя слудующих предметов могут претендовать на сертификат:\n' +
        '- математика\n' +
        '- казахский язык (казахоязычные школы)\n' +
        '- русский язык (русскоязычные школы)\n' +
        '- английский язык\n' +
        '- естествознание (география, биология)"', Markup.keyboard([
        ['На главную']
    ]).oneTime());
});
bot.hears('Какие предметы в 1 этапе?', (ctx) => {
    ctx.reply('Логическое мышление - 20 вопросов\n' +
        'Пространственное мышление - 20 вопросов', Markup.keyboard([
        ['На главную']
    ]).oneTime());
});
bot.hears('Какие предметы во 2 этапе?', (ctx) => {
    ctx.reply('"Математика - 40 вопросов\n' +
        'Родной язык - 20 вопросов\n' +
        'Английский язык - 20 вопросов\n' +
        'Естествознание - 20 вопросов"', Markup.keyboard([
        ['На главную']
    ]).oneTime());
});
bot.hears('Как и где проходит 1 этап?', (ctx) => {
    ctx.reply('Тестирование 1 этапа проходиит с 1 по 10 апреля на нашем сайте 1000bala.elumiti.kz с использованием системы прокторинг для проверки академической честности. Прохождение теста доступно только с ноутбука или компьютера с веб-камерой. \n' +
        'По итогам 1 этапа будут отобраны топ 5000 участников для прохождения на следующий 2 этап.', Markup.keyboard([
        ['На главную']
    ]).oneTime());
});
bot.hears('Технические требования к сдаче 1 этапа', (ctx) => {
    ctx.reply('Убедитесь,что у вас компьютер или ноутбук на базе ОС Windows (предпочтительно) или Mac. \n' +
        'Соответствует техническим требованиям для системы тестирования:\n' +
        '• 4 Гб оперативной памяти;\n' +
        '• наличие веб-камеры (проверить подключение к системному блоку) - если компьютер\n' +
        '• наличие работоспособной камеры - если ноутбук\n' +
        '• наличие стабильного интернет-соединения не менее 1 Мбит/сек на 1 рабочее место;\n' +
        '• последние актуальные версии рекомендуемых браузеров Google Chrome, Mozilla Firefox, Opera, Yandex.', Markup.keyboard([
        ['На главную']
    ]).oneTime());
});
bot.hears('Можно ли подать апелляцию или пересдать тест?', (ctx) => {
    ctx.reply('Пересдача тестирования возможна только по решению Организационного комитета. Для тех участников, кто не смог пройти тестирование по причинам форс мажора, апелляция не предусмотрена.', Markup.keyboard([
        ['На главную']
    ]).oneTime());
});
bot.hears('Что такое прокторинг? И почему тест 1 этапа можно сдать только через ноутбук или компьютер с web камерой?', (ctx) => {
    ctx.reply('Прокторинг - это процедура контроля соблюдения правил академической честности во время Олимпиады. Прокторинг нужен для выявления фактов нарушений академической честности на платформе.', Markup.keyboard([
        ['На главную']
    ]).oneTime());
});
bot.hears('Как можно подготовиться и выиграть олимпиаду?', (ctx) => {
    ctx.reply('Для того, чтобы подготовиться к олимпиаде у вас есть возможность пройти пробное тестирование на ro.elumiti.kz. \n' +
        'Пробное тестирование включает в себя задания олимпиады «Мың бала» предыдущих лет и поможет вам ознакомиться с аналогичными задачами, с которыми вы столкнетесь на олимпиаде. \n' +
        'Оплатив один раз, у вас есть возможность пройти тестирование три раза. \n' +
        'Количество покупок неограниченно. \n' +
        'Стоимость пробного теста – 1000 тенге.', Markup.keyboard([
        ['На главную']
    ]).oneTime());
});
bot.hears('Как и где проходит 2 этап?', (ctx) => {
    ctx.reply('На втором этапа олимпиады могут участвовать только ТОП 5000 участников первого этапа. \n' +
        'Даты проведения 2 этапа с 24 по 26 апреля. 2 этап будет проходить в региональных центрах тестирования Ustudy. \n' +
        'Подробнее об участнии на втором этапе мы сообщим персонально всем 5000 участникам.', Markup.keyboard([
        ['На главную']
    ]).oneTime());
});



// Мың бала олимпиадасы туралы
bot.hears('Мың бала олимпиадасы туралы', (ctx) => {
    ctx.reply('Сізді қызықтыратын сұрақты таңдаңыз:',
        Markup.keyboard([
            ['Олимпиадаға кім қатыса алады?'],
            ['Қандай пәндер бойынша мұғалімдер сертификатқа ие бола алады?'],
            ['1 кезеңде тестілеу қандай пәндер бойынша жүргізіледі?'],
            ['2 кезеңде тестілеу қандай пәндер бойынша жүргізіледі?'],
            ['1 кезең қалай және қайда өтеді?'],
            ['1 кезеңді өтуге техникалық талаптар'],
            ['Мен апелляцияға бере аламын ба немесе тестті қайта тапсыра аламын ба?'],
            ['Прокторинг деген не? Неліктен 1 кезеңді тек ноутбук немесе web камерасы бар компьютер арқылы өтуге болады?'],
            ['Олимпиадаға қалай дайындалып, жеңіске жетуге болады?'],
            ['2 кезең қалай және қайда өтеді?']
        ]).oneTime()
    );
});

bot.hears('Олимпиадаға кім қатыса алады?', (ctx) => {
    ctx.reply('Тек 10 наурызға дейін тіркелген ауыл мектептерінің 6 сынып оқушылары', Markup.keyboard([
        ['Басты бетке']
    ]).oneTime());
});
bot.hears('Қандай пәндер бойынша мұғалімдер сертификатқа ие бола алады?', (ctx) => {
    ctx.reply('Келесі пәндердің мұғалімдері сертификатқа ие бола алады:\n' +
        '- математика\n' +
        '- қазақ тілі (қазақ тілді мектептер)\n' +
        '- орыс тілі (орыс тілді мектептер)\n' +
        '- ағылшын тілі\n' +
        '- Жаратылыстану (география, биология)', Markup.keyboard([
        ['Басты бетке']
    ]).oneTime());
});
bot.hears('1 кезеңде тестілеу қандай пәндер бойынша жүргізіледі?', (ctx) => {
    ctx.reply('Логикалық ойлау- 20 сұрақ\n' +
        'Кеңістіктік ойлау- 20 сұрақ', Markup.keyboard([
        ['Басты бетке']
    ]).oneTime());
});
bot.hears('2 кезеңде тестілеу қандай пәндер бойынша жүргізіледі?', (ctx) => {
    ctx.reply('Математика - 40 сұрақ\n' +
        'Ана тілі - 20 сұрақ\n' +
        'Ағылшын тілі - 20 сұрақ\n' +
        'Жаратылыстану - 20 сұрақ', Markup.keyboard([
        ['Басты бетке']
    ]).oneTime());
});
bot.hears('1 кезең қалай және қайда өтеді?', (ctx) => {
    ctx.reply('1 кезеңді тестілеу біздің сайтта 1 сәуірден 10 сәуірге дейін өтеді  http://1000bala.elumiti.kz/ \n' +
        'Академиялық адалдықты тексеру үшін прокторинг жүйесін қолданылады. Тестті тек ноутбуктен немесе веб-камерасы бар компьютерден алуға болады. \n' +
        'топ5000 қатысушы 1 кезеңнің қорытындысы бойынша келесі 2 кезеңге өтуге іріктеледі.', Markup.keyboard([
        ['Басты бетке']
    ]).oneTime());
});
bot.hears('1 кезеңді өтуге техникалық талаптар', (ctx) => {
    ctx.reply('Сізде Windows немесе Mac OS негізіндегі компьютер немесе ноутбук бар екеніне және тестілеу жүйесінің техникалық талаптарына сәйкес келетініне көз жеткізіңіз: \n' +
        '• 4 Гб жедел жады (RAM);\n' +
        '• жұмыс істейтін веб-камераның болуы (жүйелік блокқа қосылуды тексеріңіз)\n' +
        '• 1 жұмыс орнына кемінде 1 Мбит/сек тұрақты интернет байланысы бар болуы;\n' +
        '• ұсынылған браузерлердің соңғы жаңартылған нұсқалары - Google Chrome, Mozilla Firefox, Opera, Yandex.', Markup.keyboard([
        ['Басты бетке']
    ]).oneTime());
});
bot.hears('Мен апелляцияға бере аламын ба немесе тестті қайта тапсыра аламын ба?', (ctx) => {
    ctx.reply('Тестілеуді қайта тапсыру ұйымдастыру комитетінің шешімімен ғана мүмкін болады. Форс-мажор себептері бойынша тестілеуден өте алмаған қатысушылар үшін апелляция қарастырылмаған.', Markup.keyboard([
        ['Басты бетке']
    ]).oneTime());
});
bot.hears('Прокторинг деген не? Неліктен 1 кезеңді тек ноутбук немесе web камерасы бар компьютер арқылы өтуге болады?', (ctx) => {
    ctx.reply('Прокторинг - бұл Олимпиада кезінде Академиялық адалдық ережелерінің сақталуын бақылау процедурасы. Платформада академиялық адалдықты бұзу фактілерін анықтау үшін Прокторинг қолданылады.', Markup.keyboard([
        ['Басты бетке']
    ]).oneTime());
});
bot.hears('Олимпиадаға қалай дайындалып, жеңіске жетуге болады?', (ctx) => {
    ctx.reply('Олимпиадаға дайындалу үшін сізде ro.elumiti.kz сайтында үлгі тапсырма өтуге мүмкіндігіңіз бар. Сынақ тестілеу өткен жылдардағы ""Мың бала"" олимпиадасының тапсырмаларын қамтиды және сізге олимпиадада кездесетін міндеттермен танысуға көмектеседі.\n' +
        ' Бір рет төлегеннен кейін сізде үш рет тестілеу мүмкіндігі бар. Сатып алу саны шексіз. Сынақ тестінің құны-1000 теңге.', Markup.keyboard([
        ['Басты бетке']
    ]).oneTime());
});
bot.hears('2 кезең қалай және қайда өтеді?', (ctx) => {
    ctx.reply('Олимпиаданың екінші кезеңіне тек бірінші кезеңнің ТОП 5000 қатысушысы қатыса алады.\n' +
        '2 кезеңді өткізу күндері: 24-26 сәуір аралығында. 2 кезең Ustudy Аймақтық тестілеу орталықтарында өтеді. Екінші кезеңге қатысу туралы толығырақ біз барлық 5000 қатысушыға жеке хабарлаймыз.', Markup.keyboard([
        ['Басты бетке']
    ]).oneTime());
});


// Все важные сроки олимпиады
bot.hears('Все важные сроки олимпиады', (ctx) => {
    ctx.reply('Выберите интересующий вас вопрос:',
        Markup.keyboard([
            ['Когда будет проходить 1 этап олимпиады?'],
            ['Когда будут результаты 1 этапа?'],
            ['Когда будет проходить 2 этап олимпиады?'],
            ['Когда будут результаты 2 этапа? И как узнать статус победителей?'],
            ['Когда победителям можно подать заявку в поступление в специализированные школы для одоренных детей?'],
            ['Когда можно получить сертификат финалиста?'],
            ['Когда можно получить диплом победителя?'],
            ['Когда учителя могут получить благодарственные письма?']
        ]).oneTime()
    );
});

bot.hears('Когда будет проходить 1 этап олимпиады?', (ctx) => {
    ctx.reply('"1 этап олимпиады будет проходить с 1 по 10 апреля по всему Казахстану. Дата сдачи тестирования зависит от региона участника и тестирование можно проходить только в дни своего региона. С графиком тестирования можете ознакомиться ниже: \n' +
        '\n' +
        '1 апреля - Акмолинская, Павлодарская, Северо-Казахстанская область\n' +
        '2 апреля - Актюбинская, Атырауская, Ұлытау, Жетісу\n' +
        '3 апреля - Восточно-Казахстанская, Жамбылская, Карагандинская\n' +
        '4 апреля - Туркестанская область (определенные районы)\n' +
        '5 апреля - Туркестанская область (определенные районы)\n' +
        '8 апреля - Западно-Казахстанская, Костанайская, Абай и определенные районы Алматинской области\n' +
        '9 апреля - Кызылординская и определенные районы Алматинской области\n' +
        '10 апреля - Мангыстауская область"', Markup.keyboard([
        ['На главную']
    ]).oneTime());
});
bot.hears('Когда будут результаты 1 этапа?', (ctx) => {
    ctx.reply('Результаты 1 этапа будут доступны в течение 14 календарных дней после завершения данного этапа во всех регионах. С результатами можно будет ознакомиться в личном кабинете каждого участника, в разделе "Уведомления". Список участников ІІ этапа олимпиады будет опубликован официальном сайте Олимпиады 1000bala.elumiti.kz/for-winners, также в социальных сетях и мы персонально уведомим участников через СМС уведомление.', Markup.keyboard([
        ['На главную']
    ]).oneTime());
});
bot.hears('Когда будет проходить 2 этап олимпиады?', (ctx) => {
    ctx.reply('Даты проведения 2 этапа с 24 по 26 апреля. 2 этап будет проходить в региональных центрах тестирования Ustudy. Список участников ІІ этапа олимпиады будет опубликован официальном сайте Олимпиады 1000bala.elumiti.kz/for-winners, также в социальных сетях и мы персонально уведомим участников через СМС уведомление.', Markup.keyboard([
        ['На главную']
    ]).oneTime());
});
bot.hears('Когда будут результаты 2 этапа? И как узнать статус победителей?', (ctx) => {
    ctx.reply('Результаты 2 этапа будут доступны в течение 14 календарных дней после завершения тестирования. С результатами можно будет ознакомиться в личном кабинете каждого участника, в разделе "Уведомления". Список победителей олимпиады будет опубликован официальном сайте Олимпиады 1000bala.elumiti.kz/for-winners, также в социальных сетях и мы персонально уведомим участников через СМС уведомление.', Markup.keyboard([
        ['На главную']
    ]).oneTime());
});
bot.hears('Когда победителям можно подать заявку в поступление в специализированные школы для одоренных детей?', (ctx) => {
    ctx.reply('Победители Олимпиады смогут подать одну заявку в одну специализированную школу для одаренных детей (БИЛ, Дарын, РФМШ) после объявления результатов с 15 мая согласно графику 2024 года в Личном кабинете на сайте Олимпиады.', Markup.keyboard([
        ['На главную']
    ]).oneTime());
});
bot.hears('Когда можно получить сертификат финалиста?', (ctx) => {
    ctx.reply('Финалисты олимпиады получат сертификат ориентировочно в 20 числах мая 2024 года.', Markup.keyboard([
        ['На главную']
    ]).oneTime());
});
bot.hears('Когда можно получить диплом победителя?', (ctx) => {
    ctx.reply('Победители олимпиады получат димлом ориентировочно в 20 числах мая 2024 года.', Markup.keyboard([
        ['На главную']
    ]).oneTime());
});
bot.hears('Когда учителя могут получить благодарственные письма?', (ctx) => {
    ctx.reply('Учителя подготовившие финалистов и победителей олимпиады получат сертификат ориентировочно в 20 числах мая 2024 года.', Markup.keyboard([
        ['На главную']
    ]).oneTime());
});

// Олимпиаданың барлық маңызды мерзімдері
bot.hears('Олимпиаданың барлық маңызды мерзімдері', (ctx) => {
    ctx.reply('Сізді қызықтыратын сұрақты таңдаңыз:',
        Markup.keyboard([
            ['Олимпиаданың 1 кезеңі қашан өтеді?'],
            ['1 кезеңнің нәтижелері қашан болады?'],
            ['Олимпиаданың 2 кезеңі қашан өтеді?'],
            ['2 кезеңнің нәтижелері қашан болады?'],
            ['Жеңімпаздар дарынды балаларға арналған мектептерге қашан сұраныс бере алады?'],
            ['Финалист сертификатын қашан алуға болады?'],
            ['Жеңімпаз дипломын қашан алуға болады?'],
            ['Мұғалімдер алғыс хаттарды қашан ала алады?']
        ]).oneTime()
    );
});

bot.hears('Олимпиаданың 1 кезеңі қашан өтеді?   ', (ctx) => {
    ctx.reply('"Олимпиаданың 1 кезеңі бүкіл Қазақстан бойынша 1-10 сәуір аралығында өтеді. Сынақтама тапсыру күні қатысушының аймағына байланысты. Тестілеуді тек өз аймағына сай күндерінде тапсыруға болады.\n' +
        'Тестілеу кестесімен төменде танысуға болады:\n' +
        '1 сәуір- Ақмола, Павлодар, Солтүстік Қазақстан облыстары\n' +
        '2 сәуір - Ақтөбе, Атырау, Ұлытау, Жетісу облыстары\n' +
        '3 сәуір- Шығыс Қазақстан, Жамбыл, Қарағанды облыстары\n' +
        '4 сәуір- Түркістан облысы (белгілі аудандар)\n' +
        '5 сәуір- Түркістан облысы (белгілі аудандар)\n' +
        '8 сәуір- Батыс Қазақстан, Қостанай, Абай облыстары және Алматы облысының белгілі аудандары\n' +
        '9 сәуір- Қызылорда облысы мен Алматы облысының белгілі аудандары \n' +
        '10 сәуір- Маңғыстау облысы"', Markup.keyboard([
        ['Басты бетке']
    ]).oneTime());
});
bot.hears('1 кезеңнің нәтижелері қашан болады?', (ctx) => {
    ctx.reply('І кезеңнің нәтижелері барлық облыстағы кезең аяқталғаннан кейін 14 күн ішінде қолжетімді болады. Нәтижелермен әр қатысушының жеке кабинетінде, "хабарламалар" бөлімінде танысуға болады. Олимпиаданың ІІ кезеңіне қатысушылардың тізімі Олимпиаданың ресми сайтында 1000bala.elumiti.kz/for-winners  жарияланады. Сондай-ақ әлеуметтік желілерде және біз қатысушыларға SMS хабарлама арқылы жеке хабар етеміз.', Markup.keyboard([
        ['Басты бетке']
    ]).oneTime());
});
bot.hears('Олимпиаданың 2 кезеңі қашан өтеді?', (ctx) => {
    ctx.reply('"2 кезеңді өткізу күндері: 24-26 сәуір аралығында. 2 кезең Ustudy аймақтық тестілеу орталықтарында өтеді. \n' +
        'Олимпиаданың ІІ кезеңіне қатысушылардың тізімі Олимпиаданың ресми сайтында 1000bala.elumiti.kz/for-winners жарияланады. Сондай-ақ әлеуметтік желілерде және біз қатысушыларға SMS хабарлама арқылы жеке хабар етеміз."', Markup.keyboard([
        ['Басты бетке']
    ]).oneTime());
});
bot.hears('2 кезеңнің нәтижелері қашан болады?', (ctx) => {
    ctx.reply('2 кезеңнің нәтижелері тестілеу аяқталғаннан кейін 14 күнтізбелік күн ішінде қол жетімді болады. Нәтижелермен Олимпиаданың ресми сайтында 1000bala.elumiti.kz/for-winners жарияланады. Сондай-ақ әлеуметтік желілерде және біз қатысушыларға SMS хабарлама арқылы жеке хабар етеміз.', Markup.keyboard([
        ['Басты бетке']
    ]).oneTime());
});
bot.hears('Жеңімпаздар дарынды балаларға арналған мектептерге қашан сұраныс бере алады?', (ctx) => {
    ctx.reply('Нәтижелер жарияланғаннан кейін олимпиада жеңімпаздары 2024 жылғы кестеге сәйкес 15 мамырдан бастап дарынды балаларға арналған бір мамандандырылған мектепке (БИЛ, Дарын, РФМШ) өтінім бере алады.', Markup.keyboard([
        ['Басты бетке']
    ]).oneTime());
});
bot.hears('Финалист сертификатын қашан алуға болады?', (ctx) => {
    ctx.reply('Олимпиада финалистері сертификатты шамамен 2024 жылдың 20 мамырында ала алады.', Markup.keyboard([
        ['Басты бетке']
    ]).oneTime());
});
bot.hears('Жеңімпаз дипломын қашан алуға болады?', (ctx) => {
    ctx.reply('Олимпиада жеңімпаздары сертификатты шамамен 2024 жылдың 20 мамырында ала алады.', Markup.keyboard([
        ['Басты бетке']
    ]).oneTime());
});
bot.hears('Мұғалімдер алғыс хаттарды қашан ала алады?', (ctx) => {
    ctx.reply('Олимпиаданың финалистерді мен жеңімпаздарды дайындаған мұғалімдер сертификатты шамамен 2024 жылдың 20 мамырында ала алады.', Markup.keyboard([
        ['Басты бетке']
    ]).oneTime());
});


// Не помню логин от личного кабинета
bot.hears('Не помню логин от личного кабинета', (ctx) => {
    ctx.reply('Если вы не помните телефонный номер, который использовался в качестве логина, то: \n' +
        'Обратитесь в колл центр по номеру 87273100258 или напишите по ссылке в чат https://jivo.chat/UoLJfeceLg\n' +
        'Будьте готовы сообщить специалисту ИИН, чтобы узнать логин/тел.номер', Markup.keyboard([
        ['На главную']
    ]).oneTime());
});
// Жеке кабинетінің логині есімде жоқ
bot.hears('Жеке кабинетінің логині есімде жоқ', (ctx) => {
    ctx.reply('Егер сіз логин ретінде пайдаланылған телефон нөмірі есіңізде жоқ болса, онда:\n' +
        ' 87273100258 нөмірі арқылы байланыс орталығына хабарласыңыз немесе сілтеме арқылы чатқа жазыңыз https://jivo.chat/UoLJfeceLg\n' +
        'ЖСН-ді қызметкерге хабарлауға дайын болыңыз', Markup.keyboard([
        ['Басты бетке']
    ]).oneTime());
});

// Не помню пароль от личного кабинета или не могу войти в личный кабинет
bot.hears('Не помню пароль от личного кабинета или не могу войти в личный кабинет', (ctx) => {
    ctx.reply('Выберите подходящую проблему из списка', Markup.keyboard([
        ['Не помню пароль, выходит "Неправильный пароль"'],
        ['Не могу войти в личный кабинет, выходит "Авторизация невозможна"'],
        ['Не могу войти в личный кабинет, выходит "Пользователь не зарегистрирован"'],
        ['Не могу войти в личный кабинет - Другое'],
        ['На главную']
    ]).oneTime());
});
bot.hears('Не помню пароль, выходит "Неправильный пароль"', (ctx) => {
    ctx.reply('"1. Перейтите по ссылке 1000bala.elumiti.kz/forget-password \n' +
        '2. Выберите способ востановления пароля через SMS код\n' +
        '3. Введите телефонный номер, который указывали при регистрации и выберите пользователя (ФИО)\n' +
        '4. Введите полученный код и установите новый пароль"', Markup.keyboard([
        ['На главную']
    ]).oneTime());
});
bot.hears('Не могу войти в личный кабинет, выходит "Авторизация невозможна"', (ctx) => {
    ctx.reply('"1. Убедитесь, что вы находитесь на нашем официальном сайте 1000bala.elumiti.kz\n' +
        '2. Убедитесь, что вы хотете войти в личный кабинет в день сдачи тестирования своего региона. В дни тестирования других регионов вы не сможете авторизоваться и сдать тест.\n' +
        '3. Убедитесь в правильности вашего логина и пароля."', Markup.keyboard([
        ['На главную'],
        ['Посмотреть график тестирования всех регионов']
    ]).oneTime());
});
bot.hears('Посмотреть график тестирования всех регионов', async (ctx) => {
    await ctx.reply('1 этап олимпиады будет проходить с 1 по 10 апреля по всему Казахстану. Дата сдачи тестирования зависит от региона участника и тестирование можно проходить только в дни своего региона. \n' +
        'С графиком тестирования можете ознакомиться ниже: \n' +
        '1 апреля - Акмолинская, Павлодарская, Северо-Казахстанская область \n' +
        '2 апреля - Актюбинская, Атырауская, Ұлытау, Жетісу \n' +
        '3 апреля - Восточно-Казахстанская, Жамбылская, Карагандинская \n' +
        '4 апреля - Туркестанская область (определенные районы) \n' +
        '5 апреля - Туркестанская область (определенные районы) \n' +
        '8 апреля - Западно-Казахстанская, Костанайская, Абай и определенные районы Алматинской области \n' +
        '9 апреля - Кызылординская и определенные районы Алматинской области \n' +
        '10 апреля - Мангыстауская область',
        Markup.keyboard([
            ['На главную']
        ]).oneTime()
    );
    await new Promise(resolve => setTimeout(resolve, 1000));
    await ctx.reply('Помогли ли рекомендации?', Markup.keyboard([
        ['Да', 'Нет']
    ]).oneTime());
});
bot.hears('Да', (ctx) => {
    ctx.reply('Удачи на олимпиаде!', Markup.keyboard([
        ['На главную']
    ]).oneTime());
});
bot.hears('Нет', (ctx) => {
    ctx.reply('Напишите нашим специалистам через чат по ссылке, мы вам поможем и будьте готовы предоставить свои данные (ИИН и тел.номер): \n' +
        'https://jivo.chat/UoLJfeceLg', Markup.keyboard([
        ['На главную']
    ]).oneTime());
});

// Жеке кабинеттің құпия сөзі есімде жоқ немесе жеке кабинетке кіре алмаймын
bot.hears('Жеке кабинеттің құпия сөзі есімде жоқ немесе жеке кабинетке кіре алмаймын', (ctx) => {
    ctx.reply('Тізімнен сәйкес мәселені таңдаңыз', Markup.keyboard([
        ['Құпия сөз есімде жоқ, "қате құпия сөз" қатесі шығады"'],
        ['Жеке кабинетке кіре алмаймын, "Авторизация мүмкін емес" қатесі шығады'],
        ['Жеке кабинетке кіре алмаймын, "пайдаланушы тіркелмеген" қатесі шығады'],
        ['Жеке кабинетке кіре алмаймын - басқа мәселе'],
        ['Басты бетке']
    ]).oneTime());
});
bot.hears('Құпия сөз есімде жоқ, "қате құпия сөз" қатесі шығады"', (ctx) => {
    ctx.reply('"1. 1000bala.elumiti.kz/forget-password Сілтемеге өтіңіз \n' +
        '2. SMS код арқылы құпия сөзді жаңадан шығару әдісін таңдаңыз\n' +
        '3. Тіркеу кезінде енгізілген телефон нөмірін толтырып, пайдаланушыны таңдаңыз (аты-жөні)\n' +
        '4.  Алынған кодты енгізіп, жаңа құпия сөзді орнатыңыз"', Markup.keyboard([
        ['Басты бетке']
    ]).oneTime());
});

bot.launch();